# ModelVecToScreenVec

## Description
Takes Data from one space to another.

```pascal
PROCEDURE ModelVecToScreenVec(VAR pX,pY : REAL);
```

```python
def vs.ModelVecToScreenVec(p):
    return p
```

## Parameters
|Name|Type|Description|
|---|---|---|
|p|REAL|   |

## Remarks
This routine transforms a given vector from model(object) to VCS.

## Version
Availability: from VectorWorks13.0

## Category
* Objects - 2D